{
    "text": "\n\n\n\n\n\n\n\n\n\n\nHome | Uganda Coffee Development Authority\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n      Skip to main content\n    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHomeAbout UCDAUCDA EstablishmentStrategic Goals of the Corporate PlanThe Mandate of the AuthorityInformation ManualOrganisational StructureBoard Secretary’s Office & Corporate Services DirectorateDirectorate of Development ServicesExecutive DirectorateQuality and Regulatory Services DirectorateStrategy and Business Development DirectorateUCDA BoardResource CenterKey ActorsPublicationsStatisticsCoffee Policies and RegulationsReportsManualsFact SheetGalleryCoffee FarmingEstablishing a coffee farmExtension ServicesImportance of Shade Trees in CoffeeCoffee Processing Primary ProcessingSecondary ProcessingTertiary ProcessingServicesNewsPress RealeasesEventsTendersCareersContacts\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNewsPress ReleasesEventsCoffee Processing Primary ProcessingSecondary ProcessingTertiary ProcessingServicesCareersTenders\n\n\n\n\n\n\n\n\nSearch\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHomeAbout UCDAUCDA EstablishmentStrategic Goals of the Corporate PlanThe Mandate of the AuthorityInformation ManualOrganisational StructureBoard Secretary’s Office & Corporate Services DirectorateDirectorate of Development ServicesExecutive DirectorateQuality and Regulatory Services DirectorateStrategy and Business Development DirectorateUCDA BoardResource CenterKey ActorsPublicationsStatisticsCoffee Policies and RegulationsReportsAnnual ReportsMonthly ReportsManualsFact SheetGalleryCoffee FarmingEstablishing a coffee farmExtension ServicesImportance of Shade Trees in CoffeeCoffee and Cocoa DirectoryDirectory WebsiteDirectory DocumentMatching Grant DocumentsContacts\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpdate on the CoCoDev Matching Grants\n\n\nClick Here\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCongratulations QA Officers\n\n\n\nGov’t to Spend Shs35bn On Registration Of Coffee Farmers As Uganda Takes Action To Comply With EUDR Requirements\n\n\n\nUCDA Coffee Laboratory gets Q Venue Certification\n\n\n\nAfrican Union Adopts Coffee As A Strategic Crop For The Continent\n\n\n\nUganda Partners with Enveritas and JDE Peet’s to Preserve Access to EU Coffee Markets\n\n\n\nCongratulations\n\n\n\nNtambi, Wafoyo emerge 2023 National Barista, Cup Tasters Championship Winners\n\n\n\nUCDA TO HOLD FINALS OF 13TH UGANDA NATIONAL BARISTA CHAMPIONSHIP AND 8TH CUP TASTERS CHAMPIONSHIP TOMORROW, 29TH NOVEMBER 2023\n\n\n\nRE-OPENING OF PRIMARY COFFEE FACTORIES IN GREATER MUKONO, GREATER LUWERO, AND BUSOGA REGIONS \n\n\n\nACPCU, ZIGOTI WIN BEST OF THE PEARL ROBUSTA COFFEE COMPETITION 2023\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDAILY COFFEE MARKET PRICES\nIn US Cents per lb. - 06/05/2024 - 08:51\n\n\nScreen 18212.83\nRobusta – Screen 15207.83\nRobusta – Screen 12 204.83\nArabica – Bugisu AA 228.90\nArabica – Bugisu A 227.90\nArabica – Bugisu PB 227.90\nArabica – Bugisu B 225.90\nArabica – Wugar 226.90\nArabica – Drugar 207.90\nIn Uganda shillings per Kg\nKiboko 5,500-6,000\nFAQ 11,000-12,000\nArabica Parchment 11,000-12,000\nDrugar Coffee (Clean)10,000-11,000\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBeans of the Nile \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nview\n\n\n\n\n\n\n\n\n\n\n        The national coffee act, 2021\n        \n\n\n\n\n\nview\n\n\n\n\nDownload\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCoffee Licences\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPulpery Operator\nCoffee Buyer\nCoffee Grader\nCoffee Processor\nCoffee Exporter\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGet started on your licence application Process for any category.\nSee all\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCoffee Roasters\nBrewer/Coffee Shop\nWarehouse/Store\nHuller Operator\nCoffee Extractor\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nUCDA NewsletterDetails\n \nMARKUP UGANDA: Coffee & CocoaDetails\n \nCoffee RoadmapDetails\n \nCoffee ProfilesDetails\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMessage from the Managing Director\nUganda Coffee Development Authority (UCDA) has grown exponentially over the years. The role of UCDA is to provide an enabling environment for the millions of stakeholders along the coffee value chain to thrive. We have built long lasting relationships with farmers...\nread more\n\n\n\n\n\n\n\n\nHow we Oversee the Coffee sub Sector in Uganda \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGov’t to Spend Shs35bn On Registration Of Coffee Farmers As Uganda Takes Action To Comply With EUDR Requirements\n\n\n\n\nRead more about Gov’t to Spend Shs35bn On Registration Of Coffee Farmers As Uganda Takes Action To Comply With EUDR Requirements\n\n \n\nThe Government of Uganda is committed to register all coffee farmers and have the National Traceability System in place so as to comply with the European Union Regulations on deforestation-free products (EUDR), Dr Emmanuel Iyamulemye, the Managing Director at Uganda Coffee Development Authority (UCDA), has revealed.\nIyamulemye says the National Coffee Register as provided for in the National Coffee Act 2021, will be a precursor to the creation of a National Traceability System (NTS) aligned with European Union Regulations on deforestation-free products (EUDR) requirements.\nThe register will assign unique identifiers and geolocations to all coffee farms.\nIyamulemye says Government through the Ministry of Finance, Planning and Economic Development is committed to register farmers in a phased manner.\n“The exercise requires up to US$9.15m (Shs35.6bn). The Ministry of Finance has committed to provide up to Shs13bn in the 2024/25 Financial Year towards farmer registration and the National Traceability System,” Iyamulemye said, adding that further funds will be provided in subsequent years.\nIyamulemye was speaking at a stakeholders meeting held at Serena Hotel on Tuesday to validate the National Action Plan for compliance with the Corporate Sustainability Due Diligence Directive (CS3D) and EU regulations on deforestation-free products (EUDR) in the coffee value chain.\nThe meeting was organized by UCDA, in partnership with International Trade Centre and the Uganda Coffee Federation.\nTo comply with EUDR requirements, Iyamulemye says, Uganda is using the Territorial Approach (TA) in the short run so as to make the country as a whole compliant.\nThis approach is not a farmer registration system as no farmer data is collected. It is not a coffee traceability system either.\nThe TA is based on the premises that; coffee production is not a main driver of deforestation. All coffee polygons (including non-compliant ones) can be identified using High Resolution (HR) maps and Artificial Intelligence (AI). Once non-compliant plots are remediated, the territory (country) is compliant in its entirety.\n“We are now engaging the EU to accept the Territorial Approach because the deadline is so short (31st December 2024) for us to have the national register and the National Traceability System where each farmer will have a unique code,” Iyamulemye said.\nHe said many coffee producing countries including Vietnam, Ethiopia, Peru, Guatemala and Tanzania among others are looking at the Territorial Approach in the short run to comply with EUDR requirements.\n“We have to show that there’s something we are doing to comply with EUDR requirements,” he said, adding: “Roasters in the EU want Uganda to be compliant with EUDR requirements because our coffee is of very high quality.”\nIyamulemye revealed that there are already private companies doing voluntary certification and registration of farmers they deal with.\n“These farmers get a premium price. We should focus on producing very high quality coffee and comply with all the regulations. Once we do that, the price will even be higher,” he said.\nSanne Willems, the Team Leader Green Transition & Private Sector from the Delegation of the European Union to Uganda, said EUDR is good because it aims to reduce deforestation and address climate change crisis the world is facing.\n“Climate change has its impact on coffee production. In certain areas, it’s too hot to produce coffee. We all agree that the background of this legislation is a good one,” Willems says, adding that over 60% of Uganda’s coffee exports go to the EU market.\n“The EU market is the biggest for Uganda coffee at the moment and it’s important (for Uganda) to keep it. It’s not so easy to start exporting to other new markets,” she says, adding that the responsibility to ensure coffee exported from Uganda is compliant is with the importers in the EU.\nSpeaking at the same event, Robert Nangatsa, the Extension Manager at UCDA, said the Traceability System will fundamentally change the coffee sub-sector.\n“Once we roll out the Traceability System, how we trade coffee will change significantly. A trader will be required to trace coffee back to the plot where it was grown. Each farmer will be registered in the National Coffee Registry, as per the Coffee Act,” Nangatsa said.\nOn 5th December 2022, the European Parliament approved a regulation for deforestation-free products to ensure supply chains remain free from products that cause deforestation.\nUnder the Deforestation Regulation, only products that are legal in the country of production and not linked to deforestation and forest-degradation after 31 December 2020 can be placed on the EU market. The regulation which takes effect on 1st January 2025 requires that exporters of commodities such as coffee, cocoa and their derivatives must submit specific documents to export to the EU market. The regulation sets specific criteria for products imported into and exported out of the EU market to be deforestation-free.\nAdditionally, the EU’s Corporate Sustainability Due Diligence Directive (CS3D) compels companies to undertake mandatory due diligence to identify and address human rights abuses and environmental damage in their global value chains.\nSource: www.businessfocus.co.ug\n\nFeature on slide\nYes\n\n\n\n\n\n\n\n\nUCDA Coffee Laboratory gets Q Venue Certification\n\n\n\n\nRead more about UCDA Coffee Laboratory gets Q Venue Certification\n\n \n\nThe Coffee Quality Institute (CQI), the world’s leading body in coffee quality training and certification, has awarded Q Venue recognition to the Uganda Coffee Development Authority (UCDA). The UCDA Coffee Laboratory is now internationally recognized as a center of excellence for coffee quality assessment and allows UCDA to offer Q Arabica and Q Robusta training, especially to the youth interested in building a career in the coffee industry.\nThis milestone reaffirms our commitment to improving the quality of Uganda coffee, promoting value addition, and driving positive change in the coffee industry.\nSupport to industry growth\nLocations certified with Coffee Quality Institute let the world know that they meet international standards. The Q Venue provides a consistent, predictable learning environment where educators know that they will have the tools and space they need to deliver courses that maintain international standards.\nThe Q venue supports the certification of Q Arabica and Q Robusta graders who are highly specialized coffee professionals who are able to speak the same language with other professionals internationally with regards to coffee quality. They are able to differentiate specialty Arabica and Fine Robusta coffees that are sought for in specialty markets thus fetching premium prices. These will be able to advise farmers on how to improve quality of their coffees and benefit from these niche markets.\n\nFeature on slide\nYes\n\n\n\n\n\n\n\n\nAfrican Union Adopts Coffee As A Strategic Crop For The Continent\n\n\n\n\nRead more about African Union Adopts Coffee As A Strategic Crop For The Continent\n\n \n\nThe African Union (AU) heads of state Assembly has endorsed the G25 Kampala Declaration on coffee, making coffee a strategic crop for the continent.\nThe heads of state made coffee a strategic commodity for the continent on February 19, 2024 during the 37th AU Summit held in Addis Ababa, Ethiopia.\nThe Kampala declaration on coffee that was endorsed by heads of state came out of the G-25 Coffee Summit held in August last year in Kampala that asked the AU to make coffee a strategic commodity under the AU agenda 2063.\nThe Ugandan delegation in Ethiopia was led by Vice President Jessica Alupo, Minister for Agriculture, Frank Tumwebaze and Minister of Foreign Affairs, Jeje Odongo.\nTumwebaze says the AU  Assembly also resolved that  the next  extra ordinary AU Summit to consider the post-Malabo CAADP framework will be held in Kampala, Uganda in January 2025. Uganda currently chairs the special technical committee on Agriculture, rural development and water ( blue economy).\nIt should be noted that during the second meeting of the G-25 African Coffee Summit held in Kampala in August last year, leaders from coffee-producing countries in Africa agreed to push the value addition agenda and halt the export of raw coffee beans. This initiative is aimed at elevating the income of farmers and curtailing the exploitation perpetuated by Western nations.\nAll participants at the summit, unanimously emphasized that for Africa to capitalize on the lucrative coffee industry, the continent’s producing nations must assume control and dominance within the market.\nWhile opening the summit, President Yoweri Museveni presented statistics demonstrating that even though Africa contributes a significant portion of coffee to the global market, the producing countries reaped the least benefits from the coffee economy.\nMuseveni added that all is not lost as the situation can be reversed by emphasizing the imperative for coffee-producing nations to enhance the value of their crop. He contended that this approach will not solely amplify revenue derived from the coffee industry but will also engender increased local employment opportunities, thereby mitigating the escalating unemployment rates.\nThe President underscored the viability of prohibiting the export of raw coffee and rectifying the inequitable international market dynamics. He told to the delegates that Uganda has already taken steps in this direction by imposing export bans on various raw materials, including valuable minerals such as uranium, copper, wolfram, and iron ore, along with currently sought-after resources like lithium.\nSource: www.businessfocus.co.ug \n\nFeature on slide\nYes\n\n\n\n\n\n\n\n\nUganda Partners with Enveritas and JDE Peet’s to Preserve Access to EU Coffee Markets\n\n\n\n\nRead more about Uganda Partners with Enveritas and JDE Peet’s to Preserve Access to EU Coffee Markets\n\n \n\nThe Managing Director of the Uganda Coffee Development Authority (UCDA), Dr. Emmanuel Iyamulemye, Sustainability Director at JDE Peet’s, Ms. Nadia Hoarau-Mwaura, and Chief Executive Officer of Enveritas, Mr. David Browning, announced last week that the UCDA, JDE Peet’s, and Enveritas have entered into an agreement to implement a scheme that will enable Enveritas to verify that the coffee industry in Uganda does not export coffee grown on land deforested after 2020, as required by the new European Union Deforestation Regulation (EUDR).\nThis regulation, which impacts this year's coffee harvests, is designed to ensure that European citizens are not contributing to deforestation and biodiversity loss through the products that they buy and consume. As a result of signing this agreement the parties will take joint action to remediate coffee which infringes the regulation, allowing Uganda to have its entire coffee production area, grown by close to two million producers, assessed as being deforestation-free using Enveritas’ territorial approach.\nIn addition, through this landmark agreement, JDE Peet’s will support the rehabilitation of land deforested and converted to coffee after 2020. Ms Hoarau-Mwaura said, “Uganda is a key coffee origin for JDE Peet’s and we are proud to partner with UCDA and Enveritas to preserve access to this coffee for our consumers. While EU consumers are rightly concerned that their consumption habits may contribute to climate change and environmental degradation, it is vital that action to mitigate this risk takes into account the social implications of hurting coffee farmer livelihoods. This agreement addresses both environmental and social concerns.”\nEnveritas’ territorial approach involves a technologically sophisticated process to monitor all of Uganda’s coffee growing region through a combination of high-resolution satellite imagery, machine learning, and teams on the ground. A protocol developed by UCDA will ensure that any coffee which is found to be in contravention of the new regulation is removed from the supply chain.\nOnce removed, JDE Peet’s will work with the farmers to reforest the land. This innovative and inclusive JDE Peet’s Enveritas countrywide solution, supported by the EU’s concept of declaration in excess, allows coffee producing land, at a vast scale, to be assessed as deforestation free, delivering on the climate journey while protecting smallholder farmers.\nDr. Iyamulemye said, “We have been monitoring closely the requirements of the EU and realized that Uganda would need to develop an innovative approach. Uganda is home to nearly two million coffee producers, the second largest population of coffee producers in the world. Traditional approaches to farm traceability might work for some of our producers, but we needed a solution at a national level or the bulk of Ugandan coffee producers might be denied access to the EU market during the 2024 harvest. This partnership allows us to take concrete action to address EU concerns regarding the deforestation caused by coffee, while also ensuring that smallholder farmers do not have their livelihoods put at risk.\"\nCoffee-growing area of Uganda (pink). Base image courtesy NASA; crop detection overlay copyright Enveritas. \nMr. Browning said, “We are excited to partner with UCDA and JDE Peet’s on this landmark agreement. A typical Ugandan coffee farmer has less than half a hectare of coffee, and might earn only a few hundred dollars a year in coffee income. Very few Ugandan coffee farmers deforest their land to plant coffee, but how could this be validated? This partnership is a great example of how technology can be used for good. Rather than attempting to individually knock on the door of millions of farmers at enormous expense, machine learning can pinpoint exactly where the issues exist to allow the Ugandan government to address EU concerns.\"\nEnveritas is a non-profit organization that works worldwide to support the livelihoods of smallholder coffee farmers through encouraging the responsible sourcing of coffee.\nJDE Peet’s is the largest roaster of coffee in the European Union, serving millions of consumers annually.\n\nFeature on slide\nYes\n\n\n\n\n\n\n\n\nNtambi, Wafoyo emerge 2023 National Barista, Cup Tasters Championship Winners\n\n\n\n\nRead more about Ntambi, Wafoyo emerge 2023 National Barista, Cup Tasters Championship Winners\n\n \n\nIsaac Ntambi is the 13th National Barista Champion, while Wafoyo Raphael retains his crown as Uganda’s best cup taster after winning the 8th National Cup Tasters Championship.\nAs Uganda’s top Barista and Cup Tasters Competition, the 2023 edition saw the crema of the country’s coffee talent battle it out for top honours at MOTIV, often accompanied by loud cheers from the crowd showing support for their favourite competitor.\nIn the end, the craft and skill of the Barista and the say of the Judges separated the Champions from the rest of the pack.\nIsaac, who is not new to the Barista Championship circuit, has endured many setbacks, coming close in several Barista Competitions but never wearing the crown. Despite such setbacks, he never lost focus. He kept going until he finally claimed the jewel of Uganda’s top Barista.\nWhile receiving the Barista Championship trophy from Jan Sadek, EU Ambassador to Uganda and Guest of Honor of the award ceremony, the soft-spoken Isaac could only muster a few words, “It’s been a long journey.”\nFortunately, this is the beginning of an exciting chapter. Isaac will represent Uganda at the World Barista Championship in South Korea in 2024. His journey is beginning. \n \n\nFeature on slide\nYes\n\n\n\n\n\n\n\n\nUCDA TO HOLD FINALS OF 13TH UGANDA NATIONAL BARISTA CHAMPIONSHIP AND 8TH CUP TASTERS CHAMPIONSHIP TOMORROW, 29TH NOVEMBER 2023\n\n\n\n\nRead more about UCDA TO HOLD FINALS OF 13TH UGANDA NATIONAL BARISTA CHAMPIONSHIP AND 8TH CUP TASTERS CHAMPIONSHIP TOMORROW, 29TH NOVEMBER 2023\n\n \n\nUganda Coffee Development Authority (UCDA) will hold the finals of the National Barista Championship and the 8th National Cup Tasters Championship tomorrow at MOTIV, Kampala, Uganda. \nThe National Barista competition focuses on promoting excellence in coffee and advancing the barista profession. The championship seeks to identify the best baristas with the best skills and craftsmanship to make the best coffee beverages.  \nHeld annually, the competition has been on a break since 2020 when the COVID-19 pandemic broke out. \nDespite the break, the 2023 edition saw a great turn-up of competitors in the preliminary rounds. 43 competitors participated in the preliminary round and 16 qualified for the semifinals.\nThe overall winner of the Uganda National Barista Champion represents Uganda at world coffee events such as the Africa Barista Championship and World Barista Championship (WBC) that are conducted during the Specialty Coffee Association Conferences, African Fine Coffee Association Conference and World Coffee Events (WCE) in Europe. \nThe winner of the Barista Championship will represent Uganda at the World Barista Championship in South Korea. \nUganda’s participation in global coffee championships provides a platform for showcasing and marketing Uganda's coffee. It also gives visibility for Uganda as a coffee-producing country and markets it as an origin of specialty Arabica and Fine Robusta.\nUganda Coffee Development Authority (UCDA) will hold the finals of the National Barista Championship and the 8th National Cup Tasters Championship tomorrow at MOTIV, Kampala, Uganda. \nThe National Barista competition focuses on promoting excellence in coffee and advancing the barista profession. The championship seeks to identify the best baristas with the best skills and craftsmanship to make the best coffee beverages.  \nHeld annually, the competition has been on a break since 2020 when the COVID-19 pandemic broke out. \nDespite the break, the 2023 edition saw a great turn-up of competitors in the preliminary rounds. 43 competitors participated in the preliminary round and 16 qualified for the semifinals.\nThe overall winner of the Uganda National Barista Champion represents Uganda at world coffee events such as the Africa Barista Championship and World Barista Championship (WBC) that are conducted during the Specialty Coffee Association Conferences, African Fine Coffee Association Conference and World Coffee Events (WCE) in Europe. \nThe winner of the Barista Championship will represent Uganda at the World Barista Championship in South Korea. \nUganda’s participation in global coffee championships provides a platform for showcasing and marketing Uganda's coffee. It also gives visibility for Uganda as a coffee-producing country and markets it as an origin of specialty Arabica and Fine Robusta.\n \n\nFeature on slide\nYes\n\n\n\n\n\n\n\n\nRE-OPENING OF PRIMARY COFFEE FACTORIES IN GREATER MUKONO, GREATER LUWERO, AND BUSOGA REGIONS \n\n\n\n\nRead more about RE-OPENING OF PRIMARY COFFEE FACTORIES IN GREATER MUKONO, GREATER LUWERO, AND BUSOGA REGIONS \n\n \n\nKampala, 10th October 2023 – The Uganda Coffee Development Authority (UCDA) announces the reopening of all primary coffee factories in the Greater Mukono, Greater Luwero, and Busoga regions, effective Wednesday, 11th October 2023. These factories had been temporarily sealed to facilitate the natural ripening of coffee cherries at the farms. \nCoffee traders, farmers, and processors are urged to adhere to coffee regulations. Specifically, they are required to hull well-dried coffee, harvest only ripe cherries, and implement proper post-harvest practices to ensure high-quality coffee production and comply with the Coffee law. \nThe collaboration and cooperation of all stakeholders is required to ensure that the quality of Ugandan coffee is sustained. \n\nFeature on slide\nYes\n\n\n\n\n\n\n\n\nACPCU, ZIGOTI WIN BEST OF THE PEARL ROBUSTA COFFEE COMPETITION 2023\n\n\n\n\nRead more about ACPCU, ZIGOTI WIN BEST OF THE PEARL ROBUSTA COFFEE COMPETITION 2023\n\n \n\n6th September 2023, Kampala – The Uganda Coffee Development Authority (UCDA) and Uganda Coffee Federation have today released the final scores of the Best of the Pearl Robusta Competition 2023 with Ankole Coffee Producers Cooperative (ACPCU) and Zigoti Coffee as winners. \nAnkole Coffee Producers Cooperative topped the Natural Coffee category with a cupping score of 86.25 and the washed coffee category with a cupping score of 83.5. Zigoti Coffee won the Honey Coffee category with a cupping score of 85.5. These are the best robusta coffees for 2023 and will be showcased to coffee buyers globally.\nThe competition, organised by the Uganda Coffee Development Authority (UCDA) and Uganda Coffee Federation in partnership with the United States Agency for International Development (USAID) under the Feed the Future Uganda Inclusive Agricultural Markets Activity, run from 29th August – 1st September 2023 at the UCDA Coffee Quality Laboratory. This annual competition helps to identify high-quality producers.\nThirty-six samples of Robusta coffees were cupped, graded, and analysed by a panel of qualified and experienced local judges led by Brenda K Mangeni, the Head Judge, and Clare Rwakatogoro, Veronica Najjemba, Fidel Bakomeza, and Jacob Baterierega. The judges used the Coffee Quality Institute (CQI) Fine Robusta score sheet and protocols to identify and select the best Robusta coffees from across Uganda. \nZigoti's honey coffee profile was Rasin, Cocoa, Black Currants, Winey, Vanilla, and Coffee Blossom. ACPCU's natural coffee profile was Coffee Blossom, Mixed Berries, Winey, Raisin, and Tangerine. ACPCU's honey coffee profile was Coffee Blossom, Butter, Chocolate, Honey, Mango Nectar and Hints Of Berries. \nUganda is the birthplace of Robusta coffee. With increased coffee quality comes higher earnings for farmers and the country. \n\nFeature on slide\nYes\n\n\n\n\n\n\n\n\nCall For Applications Under Matching Grant Scheme To Promote Sustainable Production Of Coffee and Cocoa\n\n\n\n\nRead more about Call For Applications Under Matching Grant Scheme To Promote Sustainable Production Of Coffee and Cocoa\n\n \n\nThe Government of Uganda through Uganda Coffee Development Authority (UCDA) is implementing the Coffee and Cocoa Development Project (CoCoDEV) under Inclusive Green Economy Uptake (GreenUp) Financing Agreement of the 11th European Development Fund (EDF).\nUCDA will utilize part of the funds under CoCoDEV project to implement a matching grants scheme to support farmers to establish production units of coffee and cocoa.\nThe objective of the Matching Grant Scheme (MGS) is to stimulate and promote sustainable commercial- production and productivity in the coffee and cocoa value chain.\nDeadline for submission of applications is 30th September 2023.\nEligibility criteria: To be considered for funding, the applicant must:\n1. Be an individual commercial coffee/cocoa farmer, registered private entity, coffee/cocoa cooperative, coffee/cocoa association, coffee /cocoa Community Business Organization/communal group.\n2. Be directly responsible for the preparation and management of the grant.\n3. All applicants should be 18 years and above.\n4. Must possess a land suitable for coffee/cocoa production of minimum 10 acres (4 hectares)\n5. Legal land ownership/user rights. Land must be free from encumbrances and conflicts\n6. Must possess land within the eligible districts\n7. Must be willing to use own funds for initial investment in establishment of coffee/cocoa farms.\nEligible Activities: The funding will support the following production related activities include:\n1. Procurement of planting materials (seeds, seedlings, clonal cuttings)\n2. Carrying out good agricultural practices including climate change adaptation measures (shade trees seedlings and banana suckers)\n3. Fertilizers (plant nutrition)\n4. Pests, disease and weed management measures (pesticides, fungicides & herbicides)\nClick here to download the form\nOr\nView Answers to the Frequently Asked Questions\n \n\n\nFeature on slide\nYes\n\n\n\n\n\n\n\n\nUgandan Brands Win Coffees Roasted At Origin International Competition In Paris\n\n\n\n\nRead more about Ugandan Brands Win Coffees Roasted At Origin International Competition In Paris\n\n \n\nUgandan Coffee brands have been recognized among the world’s best coffees at the 9th International Contest of “Coffees roasted at origin” 2023 competition held in Paris, France.\nThe winners of the competition were announced on Tuesday, July 18, 2023 in Paris, France.\nThe competition is organized by the Agency for Valorization of Agricultural Products (AVPA) to enable producers to improve consumer perception of exceptional coffees cultivated and roasted properly by the producers.\nAVPA offers an opportunity to producers (individual or organized in associations or cooperatives) who take responsibility for their roasting and roasters located in the countries of production and guarantee the traceability of their coffees, to participate in the contest “Coffees roasted at origin”.\nThe Uganda Coffee Development Authority (UCDA) submitted an impressive selection of 15 samples of roasted coffees from Ugandan farmers and roasters to this prestigious contest.\nNearly 200 exceptional coffees/samples spread over 25 countries from four continents took part in the competition.\nWinners\nTwo Ugandan coffee brands won Gold medals; Gorilla Highlands from Bwindi and Sasa Coffee from Mount Elgon area.\nZicofe, Kikobero Coffee and Nucafe received Silver, while Big Gorilla, Dicana Coffee and Sipi Hills won Bronze medals.\nMugamba Organic, Nucafe, Elgon Pride, Gorilla Conservation Coffee and Masha Coffee were also recognized with Certificates of Excellence.\nUganda emerged the best in Africa as 13 of the 15 samples submitted were awarded and recognized. It was followed by Ivory Coast, Ethiopia and Kenya with five, three and two samples recognized and awarded respectively.\nPeru, Columbia and Uganda took the first three positions.\nUganda’s remarkable coffees embody the diverse flavors and rich heritage of the country’s thriving coffee industry.\nLaura Walusimbi, the Corporate Communications Manager at UCDA, congratulated all the winners of the AVPA “Coffees Roasted at Origin” competition.\n“The dedication and hard work that they put into producing such exceptional coffee is commendable. UCDA is mandated to regulate, promote, and oversee the coffee industry and we pledge our full support to all stakeholders. Together, we will elevate Uganda’s outstanding coffee to global recognition,” she said.\nQuality improving\nThe competition organizers say they received fantastic coffee from all over the world and that it was a hard task for jury members to do the tasting and pick the eventual winners.\nThe AVPA jury consists of six to twelve members. The jury members are French speaking; they are professionals in the coffee industry (producers, roasters, and distributors), chefs, gourmets and discerning consumers.\n“The quality of the green coffee that has been used in the selection is really good,” a taster said, adding: “The profile, packaging and the quality has really improved. We are hopeful that the coffees that were recognized with medals get to have the recognition on the market and improve what they are already doing.”\nThe organizers say that for those who were not awarded, it is a chance for them to improve the quality of their coffee and the roast profile.\nA coffee taster, Marilyn Kennedy, appealed to participants to “keep up the good work.”\n“We need to elevate the quality of coffee all over the world and you are there to do that and we are here to taste that coffee,” she said.\nPremium Prices in the offing\nRichard Rugaya, the Founder of Gorilla Highlands, says the Paris event is going to help them achieve premium prices by selling coffee roasted at the origin and that it will help the company and the farmers improve their livelihood and incomes.\nMartin Nangoli, the founder and Managing Director of Kikobero Coffee Company Ltd, says the win of a silver medal for Kikobero Coffee was a surprise and is a huge win for Ugandan Specialty coffee.\n“Kikobero Coffee was selected and submitted for this competition. The win means a lot for our Ugandan coffee on any shelves anywhere in the world. It means our coffee is of high quality,” Nangoli.\nHe adds that roasting coffee at the origin is key as it shows that “we are in charge of our roasting profiles.”\n“If Uganda competed among 200 coffees from 25 countries and came out with such results, it means a lot in the world of coffee. It’s worth celebrating,” he said.\n“We look after our farmers, our coffee, our processors and our producers. We are concerned about every detail from the garden to the cup. This is what sets us apart. This win is setting a challenge for us to look at how to compete against giants like Ethiopia.”\nHe applauded UCDA for objectively considering and submitting a number of coffee samples from Uganda including Kikobero coffee to showcase their products at such a global event.\n \n\nFeature on slide\nNo\n\n\n\n\n\n\nPagination\n\n\n1\n\n\n2\n\n\n3\n\n\n4\n\n\n5\n\n\n\nNext ›\nNext page\n\n\n\n\nLast »\nLast page\n\n\n\n\n\n\n  Subscribe to \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIn the news\n\n\n\n\n\n \nGov’t to Spend Shs35bn On Registration Of Coffee Farmers As Uganda Takes Action To Comply With EUDR RequirementsFriday, Mar 15, 2024The Government of Uganda is committed to register all coffee farmers and have the National Traceability System in place so as to comply with the…\n \nUCDA Coffee Laboratory gets Q Venue CertificationWednesday, Feb 21, 2024The Coffee Quality Institute (CQI), the world’s leading body in coffee quality training and certification, has awarded Q Venue recognition to the…\n\n\n\n\n\n\n\n\nUpcoming Events\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMarket Analysis Reports\n\n\n\n\nDaily Report\n\n\n\n\n\nDaily Coffee Market Analysis Report\nWednesday, Jun 5, 2024\n\n\n\n\n\n\n\nMonthly Report\n\n\n\n\n\nMonthly Coffee Market Analysis Report\nApril, 2024\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOur Partners\n\n\n\n\n \n\n\n\n \n\n\n\n \n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhat We Do\n\nDevelopment Services\nBusiness Development and \n\tStrategy Services\nQuality and Regulation Services\nCorporate Services\n\n\n\n\n\n\n\n\nFocus Areas\n\nAgricultural market support\nClimate action\nPests and diseases\nWomen in coffee\nSustainable livelihoods\n\n\n\n\n\n\n\n\nContact Info\n\nCoffee House,\nPlot 35 Jinja Road,\nP.O.Box 7267,Kampala, Uganda\nTel: (+256)-414-256940 / 312-260470\nFax: +256-414-256994\nEmail: info@ugandacoffee.go.ug\n\n\n\n\n\n\n\n\n\n\n\nUganda Coffee Development Authority © All Rights Reserved -  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main-content",
        "https://www.ugandacoffee.go.ug/",
        "/index.php/",
        "/index.php/about-ucda",
        "",
        "/index.php/strategic-goals-corporate-plan",
        "/index.php/mandate-authority",
        "/index.php/information-manual",
        "/index.php/organisational-structure",
        "/index.php/board-secretarys-office-corporate-services-directorate",
        "/index.php/directorate-development-services",
        "/index.php/executive-directorate",
        "/index.php/quality-and-regulatory-services-directorate",
        "/index.php/strategy-and-business-development-directorate",
        "/index.php/ucda-board",
        "",
        "/index.php/resource-center/key-actors",
        "/index.php/resource-center/publications",
        "/index.php/resource-center/statistics",
        "/index.php/resource-center/coffee-policies-regulations",
        "",
        "/index.php/resource-center/manuals",
        "/index.php/resource-center/fact-sheet",
        "https://www.flickr.com/photos/156854116@N07",
        "/index.php/coffee-farming",
        "/index.php/establishing-coffee-farm",
        "/index.php/extension-services",
        "/index.php/importance-shade-trees-coffee",
        "",
        "/index.php/primary-processing",
        "/index.php/secondary-processing",
        "/index.php/tertiary-processing",
        "/index.php/services",
        "/index.php/news",
        "/index.php/press-releases",
        "/index.php/events",
        "/index.php/tenders",
        "/index.php/careers",
        "/index.php/contacts",
        "https://www.facebook.com/Uganda-Coffee-Development-Authority-482570061802256/",
        "https://twitter.com/CoffeeUganda",
        "https://www.instagram.com/explore/locations/992728752/uganda-coffee-development-authority/",
        "/index.php/news",
        "/index.php/press-releases",
        "/index.php/events",
        "",
        "/index.php/primary-processing",
        "/index.php/secondary-processing",
        "/index.php/tertiary-processing",
        "/index.php/services",
        "/index.php/careers",
        "/index.php/tenders",
        "/",
        "/index.php/",
        "/index.php/about-ucda",
        "",
        "/index.php/strategic-goals-corporate-plan",
        "/index.php/mandate-authority",
        "/index.php/information-manual",
        "/index.php/organisational-structure",
        "/index.php/board-secretarys-office-corporate-services-directorate",
        "/index.php/directorate-development-services",
        "/index.php/executive-directorate",
        "/index.php/quality-and-regulatory-services-directorate",
        "/index.php/strategy-and-business-development-directorate",
        "/index.php/ucda-board",
        "",
        "/index.php/resource-center/key-actors",
        "/index.php/resource-center/publications",
        "/index.php/resource-center/statistics",
        "/index.php/resource-center/coffee-policies-regulations",
        "",
        "/index.php/resource-center/reports/annual-reports",
        "/index.php/resource-center/reports/monthly-reports",
        "/index.php/resource-center/manuals",
        "/index.php/resource-center/fact-sheet",
        "https://www.flickr.com/photos/156854116@N07",
        "/index.php/coffee-farming",
        "/index.php/establishing-coffee-farm",
        "/index.php/extension-services",
        "/index.php/importance-shade-trees-coffee",
        "https://directory.ugandacoffee.go.ug/",
        "https://directory.ugandacoffee.go.ug/",
        "https://ugandacoffee.go.ug/Coffee_and_Cocoa_Directory.pdf",
        "https://ugandacoffee.go.ug/grant-documents",
        "/index.php/contacts",
        "/grant-documents",
        "/node/1049",
        "",
        "/node/1030",
        "/node/998",
        "/node/995",
        "/node/990",
        "/node/981",
        "",
        "/node/895",
        "/node/879",
        "/node/805",
        "/node/753",
        "/View",
        "/sites/default/files/2022-05/THE%20NATIONAL%20COFFEE%20ACT%2C%202021.pdf",
        "/sites/default/files/2022-05/THE%20NATIONAL%20COFFEE%20ACT%2C%202021.pdf",
        "/file-download/download/public/152",
        "/licence/pulpery-operator",
        "/licence/coffee-buyer",
        "/licence/coffee-grader",
        "/licence/coffee-processor",
        "/licence/coffee-exporter",
        "ucda-licences",
        "/licence/coffee-roasters",
        "/licence/brewercoffee-shop",
        "/licence/warehousestore",
        "/licence/huller-operator",
        "/licence/coffee-extractor",
        "https://www.ugandacoffee.go.ug/newsletter",
        "https://www.ugandacoffee.go.ug/markup-uganda",
        "https://www.ugandacoffee.go.ug/coffee-roadmap",
        "https://ugandacoffee.go.ug/sites/default/files/Uganda_Coffee_Profiles.pdf",
        "message-managing-director",
        null,
        "/node/1030",
        "/node/1030",
        "/taxonomy/term/1",
        "/node/998",
        "/node/998",
        "/taxonomy/term/1",
        "/node/995",
        "/node/995",
        "/taxonomy/term/1",
        "/node/990",
        "/node/990",
        "/taxonomy/term/1",
        "/node/895",
        "/node/895",
        "/taxonomy/term/1",
        "/node/879",
        "/node/879",
        "/taxonomy/term/1",
        "/node/805",
        "/node/805",
        "/taxonomy/term/1",
        "/node/753",
        "/node/753",
        "/taxonomy/term/1",
        "/node/735",
        "/node/735",
        "https://ugandacoffee.go.ug/Grant_Support_Application_Form.pdf",
        "https://ugandacoffee.go.ug/Grant_FAQs.pdf",
        "/taxonomy/term/1",
        "/node/683",
        "/node/683",
        "/taxonomy/term/2",
        "?page=1",
        "?page=2",
        "?page=3",
        "?page=4",
        "?page=1",
        "?page=4",
        "https://www.ugandacoffee.go.ug/rss.xml",
        "/node/1030",
        "/node/998",
        "/sites/default/files/2024-06/UCDA%20Daily%20Coffee%20Market%20Report%20%28June%2005%202024%29.pdf",
        "/sites/default/files/2024-05/April%202024.pdf",
        "https://ugandatrades.go.ug",
        "https://www.ura.go.ug/",
        "https://singlewindow.go.ug/",
        "https://www.agriculture.go.ug/",
        "https://www.facebook.com/Uganda-Coffee-Development-Authority-482570061802256/",
        "https://twitter.com/CoffeeUganda",
        "https://www.instagram.com/explore/locations/992728752/uganda-coffee-development-authority/"
    ],
    "images": [
        "themes/custom/ucda/logo.svg",
        "/themes/custom/ucda/logo.svg",
        "/sites/default/files/2022-02/coat%20of%20arms%402x.png",
        "/sites/default/files/inline-images/coffee-01%402x.png",
        "/sites/default/files/2022-02/newsletter%402x.png",
        "/sites/default/files/2022-02/markup%402x.png",
        "/sites/default/files/2022-02/roadmap%402x_0.png",
        "/sites/default/files/2022-02/profiles%402x.png",
        "/sites/default/files/inline-images/md%402x.png",
        "/sites/default/files/2024-03/DSC_2811.JPG%20EDITED_0.JPG",
        "/sites/default/files/2024-02/UCDA-2024-QVenueCert-1.jpg",
        "/sites/default/files/2024-02/AU%20Coffee.jpg",
        "/sites/default/files/2024-02/Caption%201%20-%20Dr.%20Emmanuel%20Iyamulemye%2C%20MD%20of%20UCDA%20with%20JDE%20Peet%27s%20Sustainability%20Director%20Nadia%20Hoarau-Mwaura%20and%20Enveritas%20CEO%20David%20Browning%281%29.jpg",
        "/sites/default/files/2023-12/DSC_2224.JPG",
        "/sites/default/files/2023-11/DSC_1607.jpg%20JUDGES.jpg2_.jpg",
        "/sites/default/files/2023-10/DSC_0871.JPG",
        "/sites/default/files/2023-09/DSC_0739%20%282%29.JPG",
        "/sites/default/files/2023-08/DSC_1084.JPG",
        "/sites/default/files/inline-images/UCDA%20FP-6_page-0001.jpg",
        "/sites/default/files/2023-07/Roasted%20Coffee%20Brands.jpg",
        "/sites/default/files/styles/news_front/public/2024-03/DSC_2811.JPG%20EDITED_0.JPG?itok=Z4GshWy_",
        "/sites/default/files/styles/news_front/public/2024-02/UCDA-2024-QVenueCert-1.jpg?itok=tx5Au-Pt",
        "/sites/default/files/2022-02/ug%20portal%402x.png",
        "/sites/default/files/2022-02/ura%402x.png",
        "/sites/default/files/2022-02/single%20window%402x.png",
        "/sites/default/files/2022-02/maif%402x.png",
        "/sites/default/files/inline-images/logo-white.png"
    ],
    "tables": []
}